#Склонение слова
#Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на экран
#отдельной строкой для каждого из чисел в интервале от 1 до 100:
#1 процент
#2 процента
#3 процента
#4 процента
#5 процентов
#6 процентов
#...
#100 процентов

#a = [2, 3, 4, 22, 23, 24, 32, 33, 34, 42, 43, 44, 52, 53, 54, 62, 63, 64, 72, 73, 74, 82, 83, 84, 92, 93, 94]
#gap = [1, 21, 31, 41, 51, 61, 71, 81, 91]

num = 1
sum = 0
word = 'Процент'
while num <= 100:
    print(num)
    sum = num % 10
    num = num+1
    if sum >= 2 and sum <= 4:
     print('Процента')
    elif sum == 1:
     print('Процент')
    elif sum >= 5 and sum <= 11:
     print('Процентов')